[
  {
    "title": "MLOps Engineer",
    "company": "Clarifai",
    "location": "Washington, DC",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-clarifai-3953818552?position=1&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=gqNUCMOrnsYIkXBHCOoRGQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "About the CompanyClarifai is a leading, full-lifecycle deep learning AI platform for computer vision, natural language processing, and audio recognition. We help organizations transform unstructured images, video, text, and audio data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States, Canada, Estonia, Argentina & India.We have raised $100M in funding to date, with $60M coming from our most recent Series C, and are backed by industry leaders like Menlo Ventures, Union Square Ventures, Lux Capital, New Enterprise Associates, LDV Capital, Corazon Capital, Google Ventures, NVIDIA, Qualcomm and Osage.Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce.The OpportunityNote: We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas for this particular opportunity, as we are looking for someone who is eligible for a Secret or Top Secret Clearance.Join our high-velocity, talented AI research and software engineering teams to build innovative Applied Computer Vision and Enterprise AI solutions addressing critical public sector problems. You will maintain data ingestion and model development pipelines with a strong focus on detail and testing, deploy cutting-edge AI algorithms into production, and build and maintain efficient pipeline tooling. This role allows you to make a significant impact on both the company and the broader AI field by solving challenging customer problems and integrating real-world ML Ops pipelines into the Clarifai platform.Key Responsibilities:Collaborate with scientists and engineers to enhance object detection, segmentation, tracking, and visual search capabilities and develop new products.Deploy production-ready models to customers and iteratively improve them based on feedback.Maintain our research ML infrastructure.Transition research projects from proof of concept to production.Integrate your work directly into Clarifai's AI orchestration platformImpactYou will drive customer acquisition and revenue growth, working closely with various teams across the company, including research, backend, infrastructure, product, frontend, and design. This role offers a unique opportunity to make a substantial impact on the company and the AI industry.Requirements3+ years of experience with Python, focusing on Machine Learning or Computer Vision (PyTorch/TensorFlow).Strong MLOps philosophy and experience with associated tooling (Git, CI/CD, Docker, Kubernetes, Kubeflow, Hydra).Experience building and maintaining CI/CD pipelines with an emphasis on DevOps best practices.3+ experience with large scale software development: testing, automation, system-design, performance optimization, concurrent development3+ years of cloud exposure: AWS, Google Cloud, Azure (at least one of them)Comfortable working in a shell environment.Experience working with complex existing codebases.Eligible to obtain a U.S. Secret Security Clearance (U.S. Citizenship)Great to HaveExperience in object detection and tracking. Experience with model export (Torchscript, TensorRT).Experience with Golang, relational databases.The salary hiring range for this position is $125,000 - $175,000 and flexible depending on relevant experience."
  },
  {
    "title": "MLOps Engineer(NJ)",
    "company": "Tiger Analytics",
    "location": "New Jersey, United States",
    "postDate": "9 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-nj-at-tiger-analytics-3719415004?position=2&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=mePdN4gK4817v3Gf2uLfrg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Tiger Analytics is looking for experienced Machine Learning Engineers to join our fast-growing advanced analytics consulting firm. Our employees bring deep expertise in Machine Learning, Data Science, and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner.We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world. You will be responsible for:ML Engineer with 5-7 years of IT experiencePipeline Training Models, Building, Deployment, Testing, and Monitoring using AWS SageMaker, AWS CFT, AWS CodePipeline, Lambda, etcDevelop Airflow DAGs to run training and scoring pipelinesDevelop a Testing framework with Pytest Implement monitoring solution with homebrew solution using Lambda and Dash Develop Data Quality solutions potentially leveraging Great ExpectationsRequirementsBachelor's degree or higher in computer science or related, with 5+ years of work experienceAbility to collaborate with Data Engineers and Data Scientists to build data and model pipelines and help run machine learning tests and experimentsExperience in AWS - SageMaker (ProcessingJobs, TrainingModels, EndPoints)Experience in Lambda CloudFormation or Terraform Apache Airflow, Astronomer Docker Knowledge of traditional ML ModelsPython, Spark, Hadoop, and Docker with an emphasis on good coding practices in a continuous integration context, model evaluation, and experimental designKnowledge of ML frameworks like Scikitlearn, Tensorflow, and KerasExperience in Pandas, sklearn, Numpy, ScipyAdditional Skills RequiredKnowledge of Database/Data EngineeringExperience with Oracle, Spark, Hadoop, Athena, API, FastAPI, Flask, ReSTKnowledge of MLflow, Airflow, and KubernetesExperience with Cloud environments and knowledge of AWS Services, Service Catalog, SNS, SESBenefitsThis position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility."
  },
  {
    "title": "MLOps Developer",
    "company": "Software Technology Inc.",
    "location": "United States",
    "postDate": "6 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-developer%C2%A0-at-software-technology-inc-3792378653?position=3&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=ij%2Ft3pbVNu9KeU%2F438CCGw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Role: MLOps DeveloperPosition: Remote Duration :LongTerm Notes: Candidate must be willing to be part of on-call rotation.Your Future Duties And ResponsibilitiesMonitoring - Actively monitor ML jobs through logging, metrics, and alerts.Incident Management Address job failures. Rerun jobs, maintain model/job versions in production.Infrastructure Scalability - Scale infrastructure to handle production workloads. Tuning, capacity planning, cost optimization.Compliance and Security - Apply security best practices. Encrypt data, manage secrets, enforce access controls.Technical Support - Troubleshoot integration and infrastructure issues.Operations Review Monthly Incident management summary, Change management summary and other support metrics.Model Re-training - Schedule regular retraining of models on new data. Manage code and config changes needed for retraining.Model Evaluation - Continuously evaluate model performance on test data. Watch for statistical validation issues.Data Validation - Monitor production data inputs. Check for statistical changes, missing values, outliers, errors.Dependency Management - Manage libraries, frameworks, ML pipelines. Keep versions aligned across dev, test, prod environments.Update Python package versions for Airflow and Lambda if libraries become deprecated and other components and services as needed to customize the environment.DevOps Use version control, Infrastructure as Code, and Configuration Management tools to develop automation which deploys code base.Automation Programmatically define repeatable and reliable tasks which reduce operational overhead.Testing programmatically enforcing quality standards related to the application, automation, and underlying ml models.Required Qualifications To Be Successful In This RoleRequirements: 3-7 years of proven experience in the following areas:CloudAWS CLIAWS SDK (boto3)Parameter store & Secrets ManagerLambdaData EngineeringSQL (Ability to write, Debug, and optimize queries)DynamoDBRedshiftProgramming: IDE (VS Code / PyCharm),Testing (unit test/pytest/mock)PythonMachine LearningML Development (Sage Maker)ML Programming (Pandas, NumPy, Scikit Learn, Matplotlib, lightgbm)ModelingDevOpsGeneral Linux Terminal (ps, awk, grep, netstat, etc.)Shell Scripting (BASH)YAML, IaC (Terraform, Cloud Formation)CI/CD (Code Build, Code Deploy)Orchestration (Apache Airflow)Containerization (Docker, Kubernetes)Thanks & RegardsMohan saiTechnical recruiterPhone# +1-619-605-0324|mohan.sai@stiorg.comSoftware Technology, Incwww.stiorg.com"
  },
  {
    "title": "MLOPS Engineer",
    "company": "AddSource",
    "location": "United States",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-addsource-3929079753?position=4&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=%2B8IxyXUY4RR%2BnHwN7ENB%2FA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Key ResponsibilitiesDesign, build, and maintain cloud infrastructure on AWS using tools such as CloudFormation and Terraform, following infrastructure as code principles, with a focus on establishing and maintaining best practices for MLOps infrastructure. Manage and optimize AWS services such as AWS Sagemaker and AWS ECS. Implement security best practices and ensure compliance with industry standards. Collaborate with development teams to streamline the software development lifecycle. Monitor system performance and troubleshoot issues to ensure uptime and reliability. Design and implement cloud network architecture, including VPCs, subnets, SGs, DNS, load balancers. Implement and manage CI/CD pipelines for automated deployment and testing. RequirementsExtensive experience with AWS system and network architecture design, with specific focus on AWS Sagemaker and AWS ECS. Strong proficiency in CloudFormation and Terraform for infrastructure as code. Proficiency in at least one programming language, with preference for Ruby. Strong problem-solving skills and the ability to troubleshoot complex issues. AWS Solutions Architect certifications (optional but preferred). Experience with infrastructure migration projects is a plus. Excellent communication and collaboration skills. EDUCATION Bachelor’s degree in computer science or equivalent certifications."
  },
  {
    "title": "MLOps Engineer",
    "company": "Clarifai",
    "location": "Washington DC-Baltimore Area",
    "postDate": "6 days ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-clarifai-3952878718?position=5&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=t2IUDkZJvfX%2B7YeiCp3i0A%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "About the CompanyClarifai is a leading, full-lifecycle deep learning AI platform for computer vision, natural language processing, and audio recognition. We help organizations transform unstructured images, video, text, and audio data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States, Canada, Estonia, Argentina & India.We have raised $100M in funding to date, with $60M coming from our most recent Series C, and are backed by industry leaders like Menlo Ventures, Union Square Ventures, Lux Capital, New Enterprise Associates, LDV Capital, Corazon Capital, Google Ventures, NVIDIA, Qualcomm and Osage.Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce.The OpportunityNote: We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas for this particular opportunity, as we are looking for someone who is eligible for a Secret or Top Secret Clearance.Join our high-velocity, talented AI research and software engineering teams to build innovative Applied Computer Vision and Enterprise AI solutions addressing critical public sector problems. You will maintain data ingestion and model development pipelines with a strong focus on detail and testing, deploy cutting-edge AI algorithms into production, and build and maintain efficient pipeline tooling. This role allows you to make a significant impact on both the company and the broader AI field by solving challenging customer problems and integrating real-world ML Ops pipelines into the Clarifai platform.Key Responsibilities:Collaborate with scientists and engineers to enhance object detection, segmentation, tracking, and visual search capabilities and develop new products.Deploy production-ready models to customers and iteratively improve them based on feedback.Maintain our research ML infrastructure.Transition research projects from proof of concept to production.Integrate your work directly into Clarifai’s AI orchestration platformImpactYou will drive customer acquisition and revenue growth, working closely with various teams across the company, including research, backend, infrastructure, product, frontend, and design. This role offers a unique opportunity to make a substantial impact on the company and the AI industry.Requirements3+ years of experience with Python, focusing on Machine Learning or Computer Vision (PyTorch/TensorFlow).Strong MLOps philosophy and experience with associated tooling (Git, CI/CD, Docker, Kubernetes, Kubeflow, Hydra).Experience building and maintaining CI/CD pipelines with an emphasis on DevOps best practices.3+ experience with large scale software development: testing, automation, system-design, performance optimization, concurrent development3+ years of cloud exposure: AWS, Google Cloud, Azure (at least one of them)Comfortable working in a shell environment.Experience working with complex existing codebases.Eligible to obtain a U.S. Secret Security Clearance (U.S. Citizenship)Great to HaveExperience in object detection and tracking.Experience with model export (Torchscript, TensorRT).Experience with Golang, relational databases.The salary hiring range for this position is $125,000 - $175,000 and flexible depending on relevant experience."
  },
  {
    "title": "MLOps Engineer - Grand Rapids, MI",
    "company": "Software Technology Inc.",
    "location": "Grand Rapids, MI",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-grand-rapids-mi-at-software-technology-inc-3941634235?position=6&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=Mpy2XF%2FgQya9I%2FPtXiMBtQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "QualificationsBachelor's degree in Computer Science, Engineering, or related field (Master's preferred).Proven experience as an MLOps Engineer or similar role, with a strong track record of deploying and managing machine learning models in production.Proficiency in programming languages such as Python, and experience with popular ML frameworks like TensorFlow or PyTorch.Familiarity with containerization technologies like Docker and orchestration tools like Kubernetes.Experience with cloud platforms such as AWS, Azure, or Google Cloud.Solid understanding of CI/CD principles and tools like Jenkins, CircleCI, or GitLab CI/CD.Strong knowledge of version control systems, preferably Git.Experience with monitoring tools and frameworks like Prometheus, Grafana, or ELK Stack.Ability to collaborate effectively with cross-functional teams and communicate technical concepts clearly.Excellent problem-solving skills and a proactive approach to troubleshooting and resolving issues.Strong attention to detail, organizational skills, and ability to manage multiple tasks and projects simultaneously.Experience with infrastructure as code (IaC) tools like Terraform or Ansible is a plus."
  },
  {
    "title": "Junior MLOps Tester",
    "company": "TekIntegral",
    "location": "Westbrook, ME",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/junior-mlops-tester-at-tekintegral-3888465092?position=7&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=CTkW3TsPGC6R4A1XghToFA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Title: ML Software Engineer x2 openingsVisa: Any except H1B and OPT/CPTLocation: Prioritizing candidates in the Boston area who can travel to Westbrook, Maine once a month Mode of Interview: Video 2 roundsData science & pathologist - build visualizations for domain users - Web development - D3.js - image data - clinical information Python programming ML teck-stacks - DataBricks - Amazon EC2, S3 - Docker, Kubernetes Working closely with DS in PieTorch - nice to have Data sets interfacing with - large-scale data sets - Computer vision background - would be nice - leaning more towards python programming"
  },
  {
    "title": "MLOps Engineer",
    "company": "GyanSys Inc.",
    "location": "Ann Arbor, MI",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-gyansys-inc-3955720424?position=8&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=EpQHCdFrOjxf7kKcn5wskw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "GyanSys is looking for MLOps Engineer for its direct client on C2C. This is hybrid role. Please share consultants only on your W2.Location: Ann Arbor, Michigan Azure ML and related Azure technologiesStrong programming skills in languages such as Python, Java, or ScalaResponsibilities:• Design, implement, and maintain end-to-end machine learning pipelines for model training, validation, and deployment.• Collaborate with data scientists, software engineers, and DevOps engineers to integrate machine learning models into production systems.• Develop automation tools and frameworks to streamline the machine learning workflow, including data preprocessing, feature engineering, model training, and evaluation.• Optimize model performance and scalability by leveraging cloud computing resources and distributed computing techniques.• Implement monitoring and logging solutions to track model performance, data quality, and system health in production.• Manage model versioning, experimentation, and reproducibility using version control systems and experiment tracking tools.• Stay up to date with the latest trends and technologies in machine learning, cloud computing, and software engineering, and incorporate them into the MLOps workflow.• Provide technical guidance and mentorship to junior team members on best practices for MLOps. Required Skillset:• Strong programming skills in languages such as Python, Java, or Scala.• Proven experience as an MLOps Engineer, specifically with Azure ML and related Azure technologies.• Familiarity with containerization technologies such as Docker and orchestration tools like Kubernetes.• Proficiency in automation tools like JIRA, Ansible, Jenkins, Docker compose, Artifactory, etc. • Knowledge of DevOps practices and tools for continuous integration, continuous deployment (CI/CD), and infrastructure as code (IaC).Bachelor's degree or higher in computer science, engineering, mathematics, or related field. About GyanSysGyanSys Inc is a global systems integrator & solutions provider focused on providing strategic business process, technology, platform, and managed service solutions. As a recognized innovator in digital and process transformation, we specialize in SAP and Salesforce implementations, managed services, and analytics. We integrate cutting edge solutions in complex multi-cloud environments to optimize operations and to maximize return on investment. With over 1500 consultants, we are headquartered in Indianapolis USA, with delivery centers in Bangalore, India and Manilla, Philippines."
  },
  {
    "title": "MLOps Internship",
    "company": "Subconscious AI",
    "location": "New York, NY",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-internship-at-subconscious-ai-3934993443?position=9&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=f4HGRbHTZlcdRcg12tqCaA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company DescriptionSubconscious AI is a technology company that allows users to conduct causal experiments for any human behavior at a fraction of the cost and time of traditional methods. Our mission is to help people conduct research faster, with higher quality, and more ethically.We're looking for talented individuals who share our values and are excited to take part in this cutting-edge field.This role would potentially qualify recent graduates for full-time engineering.Role DescriptionThis is an internship role for a Machine Learning Operations Engineer. As an MLOps Engineer at Subconscious AI, you will be responsible for learning to develop and maintain both the front-end and back-end of our research platform. Your day-to-day tasks will be to learn to implement new features and work with our team to develop creative solutions to complex problems. You will also be expected to learn the latest technologies and work collaboratively with other members of our team to continuously improve our product.Key ResponsibilitiesLearn to develop and maintain scalable server-side logic using Python.Learn how to implement industrial-grade APIs.Write reusable, testable, and efficient code.QualificationsBachelor’s degree in Computer Science, Engineering or a related field, or equivalent experience.1+ years of experience in Python development.Curiosity about Causality, LLMs, and Operational tools like EconML and Weights and BiasesExperience with cloud platforms (e.g., GCP, Azure), CI/CD pipelines, and Github.Excellent communication and teamwork skills.Great attention to detail and organizational skills.Nice to HaveExperience with Python, Github, OpenAPI, RabbitMQ, R, Langchain, Autogen, React, WANDB, Meilisearch, Causalx, Llama, OpenAI, OpenAPI, Cohere, GCP & Azure."
  },
  {
    "title": "MLOps Engineer",
    "company": "ADLIB Recruitment | B Corp™",
    "location": "United States",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-adlib-recruitment-b-corp%E2%84%A2-3939083134?position=10&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=uNY5MogbRBV3G8SWsIn04Q%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Lead the development and optimisation of cutting-edge MLOps platforms using AWS.Collaborate with a dynamic team to drive AI innovation and excellence for an industry-first.Flexible working environment, great compensation, excellent benefits and growth opportunities.Join an exciting team at a leading investment firm, where you will play a pivotal role in deploying and managing cutting-edge machine learning models. Work with advanced technologies in a collaborative environment and contribute to significant AI-driven solutions.What you’ll be doingAs a Senior MLOps Engineer, you will be at the forefront of deploying cutting-edge machine learning models and providing comprehensive support to ensure seamless integration into production environments. Your responsibilities will include:Developing and optimising the MLOps platform to streamline the ML lifecycle.Implementing and managing CI/CD pipelines for efficient development, testing and deployment processes.Collaborating with data scientists and engineers to drive innovation and excellence in AI solutions.Ensuring scalability, reliability, and performance of machine learning workloads through robust infrastructure management.Championing best practices for writing production-quality code and implementing robust ML frameworks.What Experience You’ll Need To ApplyProven track record in designing and implementing MLOps pipelines.Experience with MLOps frameworks, particularly SageMaker and MLFlow.Strong programming skills in Python, with production environment experience.Expertise in infrastructure management using Terraform/similar.Strong interpersonal skills to engage and collaborate with multiple stakeholders.What You’ll Get In Return For Your ExperienceBase salary of up to £80,000 plus bonus (15-25%).Flexible working options, including hybrid working or remote first contracts (1 day every 6-8 weeks in the office)25 days holiday plus bank holidays and additional Christmas closure time.Enhanced parental leave and pension scheme with up to 11% employer contribution.Private medical insurance, healthcare cash plans, and income protection.Opportunities for continuous learning and development, including mentoring and growth programs.Dynamic and inclusive work environment that values diversity and innovation.What’s next?If you’re ready to take on a pivotal role in an innovative environment for an industry first platform, please apply now with and up-to-date CV."
  },
  {
    "title": "Machine Learning Operations (MLOps) Engineer",
    "company": "Artmac",
    "location": "Sunnyvale, CA",
    "postDate": "4 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-operations-mlops-engineer-at-artmac-3962782771?position=11&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=J5Jo%2BkPzjL%2BmAbO9RAJK7A%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Who We AreArtmac Soft is a technology consulting and service-oriented IT company dedicated to providing innovative technology solutions and services to Customers.Job DescriptionJob Title : Machine Learning Operations (MLOps) EngineerJob Type : W2 / C2C / 1099Experience: 9-20 YearsLocation : Sunnyvale, CaliforniaWe are looking for an MLOps Engineer who will be responsible for designing, building, and maintaining machine learning infrastructure and pipelines. This role requires a deep understanding of both software engineering and data science, with a focus on deploying and maintaining scalable machine learning solutions in production environments.ResponsibilitiesHaving experience in product-based technologies Data Engineer, Infrastructure, Load Testing, Python, and DevOps.Experience with containerization and orchestration tools like Docker and Kubernetes.Hands-on experience with ML frameworks and libraries (e.g., TensorFlow, PyTorch, Scikit-Learn).Familiarity with cloud platforms such as AWS, Google Cloud, or Azure.Strong understanding of CI/CD tools and practices (e.g., Jenkins, GitLab CI/CD).Knowledge of monitoring and logging tools (e.g., Prometheus, Grafana, ELK Stack).Design and develop robust data pipelines to support machine learning workflows.Ensure data quality, integrity, and consistency across various data sources.Optimize resource utilization and manage cloud resources (e.g., AWS, Azure, GCP).Implement and manage container orchestration using Kubernetes or similar technologies.Develop and execute load testing strategies to ensure the scalability and performance of machine learning systems.Identify bottlenecks and optimize system performance under high load conditions.Develop and maintain Python scripts and libraries for data processing, model training, and deployment.Implement CI/CD pipelines to automate the deployment of machine learning models.Manage configuration and deployment of infrastructure as code (IaC) using tools like Terraform or Ansible.Monitor and maintain the health of production systems, ensuring high availability and reliability.Maintain comprehensive documentation of ML pipelines, infrastructure, and processes.QualificationBachelor's degree or equivalent combination of education and experience"
  },
  {
    "title": "Remote Opportunity: MLOPS Engineer",
    "company": "SPAR Information Systems LLC",
    "location": "United States",
    "postDate": "5 months ago",
    "link": "https://www.linkedin.com/jobs/view/remote-opportunity-mlops-engineer-at-spar-information-systems-llc-3806322039?position=12&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=cKE4ukqeHHT43JGEcZ5X4Q%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "LLMOps/MLOps",
    "company": "CitiusTech",
    "location": "United States",
    "postDate": "1 day ago",
    "link": "https://www.linkedin.com/jobs/view/llmops-mlops-at-citiustech-3966478655?position=13&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=c9koI7x1nS0CL8XOH5B9gA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Our vision: -To inspire new possibilities for the health ecosystem with technology and human ingenuity. We envision a world where MLOps and LLM Ops empower us to unlock the full potential of ML and LLMs, accelerating innovation and delivering real-world impact.What is in it for you?As a Subject Matter Expert - ML or LLM Ops, you will be a hands-on person help implement Organization MLOps and LLMOps strategy and overseeing the development of scalable infrastructure and processes.Be an Architect of Innovation:This is your opportunity to join a dynamic team and leverage your expertise as an MLOps & LLM Ops Engineer. You'll play a pivotal role in designing and implementing robust pipelines for our ML and LLM models, ensuring efficient deployment and continuous optimization.Responsibilities: -· Work with senior architects to drive the strategic direction and technical leadership for MLOps and LLM Ops initiatives and ensure alignment with business objectives.· Demonstrate an in-depth understanding of MLOps and LLM Ops principles, including data pipelines, model training, deployment frameworks, and monitoring techniques.· Design, develop, and implement robust MLOps and LLM Ops pipelines for efficient model training, deployment, and monitoring.· Collaborate with cross-functional teams (engineering, data science, product) to ensure seamless integration of ML and LLM models into production workflows.· Communicate complex technical concepts clearly to both technical and non-technical audiences.· Stay at the forefront of MLOps and LLM Ops advancements and identify and champion new tools and best practices.Experience: -· 5- 7 Years in DevOps/ MLOps with enterprise grade modelOps· 6 months- year in LLMOpsEducational Qualifications: -· Any Bachelor/ master's degree in computer science, Data Science, or a related field (or equivalent experience).Skills: -Mandatory Technical skills· Must be abreast with CSP’s (AWS, Azure and GCP) MLOPS and LLOPS stack. GCP preferred.· Should have expert level knowledge around deploying AI stack on Kubernetes cluster and scaling the same both horizontal and vertical.· Must have experience on deploying AI applications using native services.· Must have experience on VM provisioning and network set up· Minimum over 5 years of experience in MLOps or LLM Ops along with a proven track record of successful deployments.· In-depth knowledge of MLOps tools and platforms such as Kubernetes, Docker, Jenkins, Git, MLflow, LLM-specific tooling.· Familiarity with Cloud platforms (AWS, Azure, Google Cloud) and infrastructure as code (IaC) principles.· Experience in DevOps methodologies and CI/CD pipelines.· Strong understanding of machine learning pipelines, model training frameworks, and monitoring techniques.· Experience in large language models (LLMs) and their unique operational considerations is a plus.Good to have skills: -· Excellent communication, collaboration, and problem-solving skills.· Ability to translate technical concepts into clear and concise language.· A passion for innovation and a drive to optimize ML and LLM workflows.· Written and verbal skills especially to confidently express technical ideas and solutions.Life at CitiusTechWe focus on building highly motivated engineering teams and thought leaders with an entrepreneurial mindset, centered on our core values of Passion, Respect, Openness, Unity, and Depth (PROUD) of knowledge. Our success lies in creating a fun, transparent, non-hierarchical, diverse work culture that focuses on continuous learning and work-life balance.Rated by our employees as the ‘Great Place to Work for’ according to the Great Place to Work survey. We offer you a comprehensive set of benefits to ensure that you have a long and rewarding career with us.Our EVPBe You Be Awesome is our EVP and it reflects our continuing efforts to create CitiusTech as a great place to work where our employees can thrive, both personally and professionally. It encompasses the unique benefits and opportunities we offer to support your growth, well-being, and success throughout your journey with us and beyond. Together with our clients, we are solving some of the greatest healthcare challenges and positively impacting human lives. Welcome to the world of Faster Growth, Higher Learning, and Stronger Impact.Join CitiusTech. Be You. Be Awesome. To learn more about CitiusTech, visit www.citiustech.com and follow us on social media."
  },
  {
    "title": "Senior MLOps Engineer",
    "company": "Gratiture Solutions",
    "location": "United States",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/senior-mlops-engineer-at-gratiture-solutions-3924151205?position=14&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=XSRNaRVOglZlWFfPdAzPKQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Job DescriptionSenior MLOps EngineerA well-established company that is determined to become the most consumer-centric health organization by leveraging cutting-edge technologies and innovations, is looking for a Senior MLOps Engineer. The engineer will play an instrumental role in deploying robust, scalable machine learning solutions. The candidate will ensure these are tailored to meet the expansive needs of varied healthcare services. The company is driving a transformation in health care by expanding their footprint and providing more accessible, supportive, and personalized care. This role demands a high level of proficiency in machine learning technologies and programming, coupled with rigorous vetting processes to maintain the highest standards of data integrity and security.Required Skills:  Natural Language Processing (NLP) 3 YOE Tensorflow OR PyTorch 1 YOE Pandas OR Scipy OR Numpy 1 YOEVisa Independent ( Non sponsorship position) Location : Remote and EST time zone  Start date for role: 20th May, ‘24Job Responsibilities: Rapidly develop and deploy production-ready ML models, with a focus on scalability and monitoring across a broad range of applications within healthcare Write efficient, maintainable, and scalable Python code tailored to specific business needs Build high-performance, multi-tenant deployment architectures, and sophisticated model monitoring systems Directly engage with internal stakeholders to incorporate feedback and refine the ML-driven products through quick iteration cycles Uphold stringent security protocols and processes in the deployment and maintenance of machine learning models Drive the continuous advancement of MLOps practices within the healthcare industry by developing innovative solutions and advocating for best practicesJob Requirements: Bachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 5+ years of relevant experience as an MLOps Engineer At least 3+ years of experience with transformer-based models and NLP, preferably in a healthcare context Strong track record of fine-tuning, running large-scale training jobs, and managing model servers like vLLM, TGI, or TorchServe Proficiency in data science tools such as Pandas, Notebooks, Numpy, and Scipy Demonstrable experience with both relational and non-relational databases Extensive experience with TensorFlow or PyTorch, and familiarity with HuggingFace Knowledge of model analysis and experimentation frameworks such as MLFlow, W&B, and tfma is preferred Comfortable with a Linux environment and stringent data security practices Must pass a rigorous vetting process, including extensive background checks to ensure the highest standards of data security and integrity Fluent in English communication, both written and spoken. Company DescriptionWe strive to provide the highest quality recruitment, screening, and customer service to help grow exceptional teams as well as assist professionals advance in their desired careers. Integration is at the heart of digital transformation, and Our initiatives are designed to help customers across industries accelerate time to market with our agile workforce. Our Core team includes domain experts from multiple industries with thorough knowledge and understanding of the essential aspects of any IT demand.We strive to provide the highest quality recruitment, screening, and customer service to help grow exceptional teams as well as assist professionals advance in their desired careers. Integration is at the heart of digital transformation, and Our initiatives are designed to help customers across industries accelerate time to market with our agile workforce. Our Core team includes domain experts from multiple industries with thorough knowledge and understanding of the essential aspects of any IT demand."
  },
  {
    "title": "MLOps Engineer",
    "company": "Glassbeam, Inc",
    "location": "Santa Clara, CA",
    "postDate": "1 year ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-glassbeam-inc-3349007309?position=15&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=Yw0WCudnx09zhO%2FIruFpUQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Glassbeam's mission is to enable smarter hospitals and labs with ML-powered products. Our products enable better medical device management, maintenance, and troubleshooting.As a startup, we provide a positive work environment. No bureaucracy. No useless meetings. Clear goals and clarity of purpose. Spend your day building something useful and get satisfaction from work. We empower you to take ownership. You will be encouraged to come up with and try new ideas. Get a sense of achievement from delivering innovative products and playing an important role in the growth and success of a startup.If you are an experienced MLOps engineer who enjoys working in a startup environment and deliveringinnovative products that customers use daily, we would love to hear from you.RoleProductionize ML models. Manage model lifecycle. Build ML-powered SaaS products running on AWS, Azure,and other clouds.The Ideal Candidate Has experience building production-grade ML training/ inference pipelines for a SaaS company Takes ownership of the goals assigned and gets things done Strives to develop scalable, maintainable, and reliable softwareResponsibilities Develop and maintain ML training pipeline Develop and maintain ML inference pipeline Develop tools for ML model deployment and lifecycle management Develop tools for managing ML pipeline/models Develop tools for monitoring ML pipeline/models Develop plans for both pipeline and model verification/validation Develop tools for ensuring robustness/correctness of ML pipelines/models under all scenariosRequirementsMinimum 5+ years’ experience developing and deploying in production scalable and reliable SaaS products 3+ experience developing micro-services architecture-based SaaS products 3+ years’ experience building production-grade SaaS products using Scala 1+ years’ work experience with Spark, HDFS and Kafka Strong design and programming skills Demonstrated adherence to writing unit tests Experience developing software using SCRUM methodologyPlus Hands-on experience with Cassandra, Play framework, Vertica, Delta Lake Work experience with Dockers, Kubernetes, Kubeflow, Airflow, Dagster Experience deploying production-grade ML software on AWS, Azure, Google Cloud Experience building web apps using Angular or React"
  },
  {
    "title": "MLops Engineer MAHIN-JOB-32325",
    "company": "Keylent Inc",
    "location": "Plano, TX",
    "postDate": "3 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-mahin-job-32325-at-keylent-inc-3862184692?position=16&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=BJ5KbXSu4jrCL0zQrVMrWQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Dedrone",
    "location": "Sterling, VA",
    "postDate": "",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-dedrone-3860981637?position=17&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=DqIVCJJv9DdU0aoXNRLsMA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company Overview: Dedrone is the world’s most trusted smart airspace security company. Hundreds of commercial, government and military customers around the world rely on Dedrone’s comprehensive, command and control (C2) solution to protect against the persistent and escalating threat from drones while enabling “good” drones to fly. By leveraging AI/ML, Dedrone is the only solution that provides continuous, autonomous interrogation and verification of drones that enables both multi-sensor and multi-mitigation options onto a single fused \"pane-of-glass\". Whether on-premise / air-gapped or in the cloud, Dedrone customers can easily detect, track, identify, analyze, and mitigate drone threats.As an MLOps Engineer,, you will build secure, scalable, and speedy pipelines working closely with Dedrone’s other engineering teams to architect, design, and implement infrastructure to improve and scale information retrieval.You will…Develop, build, design, continuously improve, and support the MLOps Platform. You will participate in all stages of development, use various software and tools, and enabling self-service tools for data science teams.Design,, develop, integrate, and deploy tools for Data Science and Machine Learning (ML) Research.Design and operate a framework for Machine Learning Operations (MLOps), advise on software engineering for ML, and ensure consistency with architectural principles.Provides best practices and running proof-of-concepts for automated and efficient model operations on a large scale. You have…Ability to understand tools used by data scientist and experience with software development and test automationGood to have in-depth knowledge in machine learning frameworks or libraries such as TensorFlow, Keras, PyTorch, etcProficiency in modern programming languages such as Python. At Dedrone, we believe that great ideas come from anywhere. We support a collaborative environment and value open participation from individuals with different ideas, experiences, and perspectives. We believe having a diverse team makes Dedrone a more interesting and innovative place to work, and we strive to make Dedrone a welcoming and inclusive place for all."
  },
  {
    "title": "MLOps Engineer",
    "company": "Mavinsys",
    "location": "Austin, TX",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-mavinsys-3952669251?position=18&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=DTusPI0CaOBWl5JKTurQeQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Hello, We are from Mavinsys Talent Acquisition team based on One World Trade Centre, New York. We are specializing in IT services and staffing majorly in lateral hiring/contract. Below is one of our requirement to fill immediately, if you're interested, please share your candidature to joinus@mavinsys.com Job Title: MLOps Engineer Location: Austin, TX San Jose, CA Duration: 12months Job Description; • The MLOps engineer should have 5+ years of experience in Python Pandas, Spark and will have experience building large-scale data   pipelines. • Experience in Seldon, Triton, Jenkin CI/CD. • One year of experience in Big data technologies such as BigQuery, Hadoop, SQL, Hive, GCP/Azure, Java, REST Responsibilities:  • Design & create the data pipelines and engineering infrastructure to support our clients' enterprise machine learning systems at scale • Take models that data scientists built and turn them into a machine learning production system • Develop and deploy scalable tools and services for our clients to handle machine learning training and inference • Identify and evaluate new technologies to improve the performance, maintainability, and reliability of our clients' machine learning systems • Apply software engineering rigor and best practices to machine learning, including CI/CD, automation, etc. • Support model development with an emphasis on auditability, versioning, model measurement and data security • Interpret the results of the models, read data on a fundamental level, and understand how it relates to the problem being solved by the   model. • Monitor the performance of your models, and need to be able to troubleshoot any errors or bugs that may occur."
  },
  {
    "title": "MLOps Engineer",
    "company": "FinThrive",
    "location": "United States",
    "postDate": "1 week ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-finthrive-3956372884?position=19&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=3zp1RH5BUyOuCNaE41s7ZQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Impact you will makeJoin a group of highly talented and motivated data scientists and data engineers with significant healthcare experience to help a thriving Healthcare function. Build a highly functional and efficient Data Science & Machine Learning platform that brings together data from disparate sources and allow FinThrive to design and run complex algorithms to provide insights into the Healthcare business operations. Partner with internal business, product, and technical teams to analyze requirements to deliver solutions to complex issues. Participate in development and oversee maintenance of code to ensure consistency, quality, best practices, and performance of applications.What you will doBe a key member of a growing team (data scientists, data engineers, DevOps engineers) that designs and implements predictive analytics solutions in a production environment, leveraging a variety of statistical models and machine learning algorithmsDeploy machine learning models into production environments. Integrate machine learning algorithms with existing systems and applicationDesign, build, and maintain the infrastructure for machine learning operationsCollaborate with DevOps teams to ensure scalability, reliability, and security of ML systemsImplement automation tools and processes for model training, testing, and deployment. Streamline and optimize the end-to-end machine learning lifecycleBuild tools and capabilities for model management and model performance monitoring Collaborate effectively with the team and across cross-functional stakeholdersModel a high-performance culture with critical thinking, problem-solving, learning, collaboration, and experimentation within the teamWhat you will bringBachelor's degree completed in Computer Science or a related field3+ years of experience with artificial intelligence, software engineering, MLOps, DevOps, or data engineering, in a professional roleExperience with Azure DevOps, CI/CD, Terraform, Python and other scripting languages Experience with integrating DevSecOps practices and principles throughout the project life cycleExperience with Big Data technologies, cloud-based analytics, non-relational datastores, data visualization tools, and open-source tools for data processingExperience with Agile methodologies (Scrum, Kanban) and project management tools such as Jira or Azure DevOps.Travel required: Minimal (a couple of time a year)What we would like to seeExperience with Databricks and Azure cloud platform, machine learning services, and best practicesExperience in open-source AI/ML tools, frameworks technologies (for example, TensorFlow, PyTorch, scikit-learn, Apache MXnet, Spark MLlib, etc.)Experience with predictive analytics in Healthcare, Insurance or Consumer Credit industryExperience with Databricks"
  },
  {
    "title": "MLOps Engineer",
    "company": "MashPoint - Technology & Staffing- merged with HuMetis group Inc",
    "location": "New York, NY",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-mashpoint-technology-staffing-merged-with-humetis-group-inc-3888429429?position=20&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=jzHXy5m1vx56ILP6oeCIQQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Job Title: MLOps EngineerDuration: FULL-TIMELocation: Pennsylvania, NYC, Need to Travel to any of these locations 2-3 weeks initially to understand the project after 3-4 days in a month.SummaryWe are seeking a highly skilled and experienced MLOps Engineer to join our team. You will play a crucial role in building and maintaining the infrastructure and pipelines for our cutting-edge Generative AI applications, working closely with the Generative AI Full Stack Architect. Your expertise in automating and streamlining the ML lifecycle will be instrumental in ensuring the efficiency, scalability, and reliability of our Generative AI models in production.ResponsibilitiesDesign, develop, and implement ML Ops pipelines for generative AI models, encompassing data ingestion, pre-processing, training, deployment, and monitoring.Automate ML tasks across the model lifecycle, leveraging tools like Git Ops, CI/CD pipelines, and containerization technologies (e.g., Docker, Kubernetes).Develop and maintain robust monitoring and alerting systems for generative AI models in production, ensuring proactive identification and resolution of issues.Collaborate with the Generative AI Full Stack Architect and other engineers to optimize model performance and resource utilization.Manage and maintain cloud infrastructure (e.g., AWS, GCP, Azure) for ML workloads, ensuring cost-efficiency and scalability.Stay up to date on the latest advancements in ML Ops and incorporate them into our platform and processes.Communicate effectively with technical and non-technical stakeholders about the health and performance of generative AI models.QualificationsBachelor's degree in Computer Science, Data Science, Engineering, or a related field, or equivalent experience.7+ years of experience in ML Ops or related areas, such as DevOps, data engineering, or ML infrastructure.Proven experience in automating ML pipelines with tools like ML flow, Kubeflow, Airflow, etc.Expertise in cloud platforms (e.g., AWS, Azure) for ML workloads.Strong understanding of CI/CD principles and containerization technologies like Docker and Kubernetes.Familiarity with monitoring and alerting tools for ML systems (e.g., Prometheus, Grafana).Excellent communication, collaboration, and problem-solving skills.Ability to work independently and as part of a team.Passion for Generative AI and its potential to revolutionize various industries.Senior individual contributor with significant expertise and leadership experience.Manages complex projects and initiatives with independent decision-making authority.Provides technical guidance and mentoring to junior team members.Has a proven track record of success in delivering impactful results."
  },
  {
    "title": "Sr. MLOps Engineer",
    "company": "Warrior Tech Solutions",
    "location": "Dallas, TX",
    "postDate": "5 months ago",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-at-warrior-tech-solutions-3803195090?position=21&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=KD6rQU2jX%2FPTgEFR642xAA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Enginieer",
    "company": "VRK IT Vision Inc.",
    "location": "United States",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-enginieer-at-vrk-it-vision-inc-3951768364?position=22&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=U83qYioRUcuj0ERFGEfmBA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "The MLOps engineer should have 5+ years of experience in Python Pandas, Spark and will have experience building large-scale data pipelinesExperience in Seldon, Triton, Jenkin CI/CDOne year of experience in Big data technologies such as BigQuery, Hadoop, SQL, Hive, GCP/Azure, Java, REST (nice to have)In Your Day-to-day Responsibilities Design & create the data pipelines and engineering infrastructure to support our clients’ enterprise machine learning systems at scale Take models that data scientists built and turn them into a machine learning production system Develop and deploy scalable tools and services for our clients to handle machine learning training and inference Identify and evaluate new technologies to improve the performance, maintainability, and reliability of our clients’ machine learning systems Apply software engineering rigor and best practices to machine learning, including CI/CD, automation, etc. Support model development with an emphasis on auditability, versioning, model measurement and data security Interpret the results of the models, read data on a fundamental level, and understand how it relates to the problem being solved by the model. Monitor the performance of your models, and need to be able to troubleshoot any errors or bugs that may occur."
  },
  {
    "title": "Sr. MLOps Engineer || Dallas TX (onsite Role)",
    "company": "Strategism, Inc",
    "location": "Dallas, TX",
    "postDate": "4 months ago",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-dallas-tx-onsite-role-at-strategism-inc-3829380271?position=23&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=n10r3Mv8xnBLdUf1dLoFYg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Triunity Software, Inc.",
    "location": "Austin, TX",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-triunity-software-inc-3952359325?position=24&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=m7pYIzskhLLUoVzaJmUncw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "ML Operations Engineer (MLOps)",
    "company": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/ml-operations-engineer-mlops-at-unreal-staffing-inc-3895822106?position=25&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=TyRU6ieVvIzpVXx24Jy8CQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company Overview: Welcome to the forefront of machine learning operations! At our company, we're driving the next wave of AI revolution through cutting-edge ML operations technologies. Our mission is to develop scalable and reliable ML systems that empower businesses and revolutionize industries. Join us and be part of a dynamic team committed to pushing the boundaries of what's possible with MLOps.Position Overview: As an ML Operations Engineer (MLOps), you'll play a critical role in developing and maintaining scalable and reliable machine learning pipelines and systems. Working closely with data scientists, software engineers, and DevOps specialists, you'll ensure the smooth deployment, monitoring, and optimization of machine learning models in production environments. If you're passionate about bridging the gap between data science and operations and eager to drive innovation in ML infrastructure, we want you on our team.RequirementsKey Responsibilities: ML Pipeline Development: Design, implement, and maintain end-to-end ML pipelines for model training, evaluation, deployment, and monitoring, leveraging best practices in MLOps Model Deployment: Deploy machine learning models into production environments, ensuring scalability, reliability, and performance, and automating deployment processes using CI/CD pipelines Model Monitoring: Implement monitoring and alerting systems to track model performance, data drift, and model drift, and take proactive measures to maintain model health and accuracy Infrastructure Management: Manage cloud-based infrastructure and resources for machine learning workloads, optimizing for cost, performance, and scalability Version Control: Implement version control and model versioning systems to track changes to models and ensure reproducibility and traceability Collaboration and Documentation: Collaborate with cross-functional teams to define requirements, prioritize tasks, and deliver solutions that meet business objectives, and document processes and workflows for knowledge sharing and onboarding Security and Compliance: Implement security best practices and ensure compliance with data privacy regulations in ML systems and workflowsQualifications:Bachelor's degree or higher in Computer Science, Engineering, or related fieldStrong background in machine learning operations (MLOps) or DevOps, with hands-on experience in deploying and managing machine learning models in production environmentsProficiency in programming languages such as Python, Java, or Go, and experience with ML frameworks and libraries such as TensorFlow, PyTorch, or scikit-learnExperience with cloud platforms such as AWS, Azure, or Google Cloud, and proficiency in using relevant tools and services for ML infrastructure management, such as Kubernetes, Docker, or Apache AirflowFamiliarity with CI/CD pipelines, version control systems (e.g., Git), and infrastructure as code (IaC) tools (e.g., Terraform)Strong problem-solving abilities and analytical thinking, with a keen attention to detail and a passion for tackling complex technical challengesExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for ML Operations Engineers (MLOps) typically ranges from $150,000 to $230,000 per year, depending on experience and qualifications. Exceptional candidates may be eligible for higher compensation packagesComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge ML tools and resourcesVibrant and inclusive company culture with team-building activities and social eventsOpportunities for career growth and advancement within the companyExciting projects with real-world impact across diverse industriesChance to work alongside top talent and industry experts in the field of ML operationsJoin Us: Ready to shape the future of ML operations? Apply now to join our team and be part of an exciting journey of innovation and growth!"
  },
  {
    "title": "Looking for Azure AI DevOps/MLOps - NYC NY (Hybrid) - Contract // Urgent Hiring",
    "company": "Extend Information Systems Inc.",
    "location": "New York, NY",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/looking-for-azure-ai-devops-mlops-nyc-ny-hybrid-contract-urgent-hiring-at-extend-information-systems-inc-3909185899?position=26&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=H%2FEhDtyZ%2BRmnr3UAaw8prg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "AI-ML Engineers for MLOPs/LLM Ops Capability Development",
    "company": "Zortech Solutions",
    "location": "Concord, CA",
    "postDate": "3 months ago",
    "link": "https://www.linkedin.com/jobs/view/ai-ml-engineers-for-mlops-llm-ops-capability-development-at-zortech-solutions-3890311657?position=27&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=1gsTY7U3NXYRIKCQRTS02A%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "AI DevOps/ML/ MLOps with Azure",
    "company": "Cybertec, Inc",
    "location": "New York, NY",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/ai-devops-ml-mlops-with-azure-at-cybertec-inc-3913496465?position=28&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=aqUD9r4W3x%2Bs7cFpWHlJKg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Intelliswift Software",
    "location": "Rhode Island, United States",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-intelliswift-software-3923193151?position=29&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=s%2FZQQthJB3vuS9U7zl8zUg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Vianai Systems, Inc.",
    "location": "Palo Alto, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-vianai-systems-inc-3934999749?position=30&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=iIDEJx8wTxTXZ5NTJwtBNA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Developer with AWS",
    "company": "IT Minds LLC",
    "location": "United States",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-developer-with-aws-at-it-minds-llc-3914118042?position=31&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=vWlckdDPcJiDK96jP8GlxQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Sr MLOPS Engineer",
    "company": "CloudSpace LLC",
    "location": "North Carolina, United States",
    "postDate": "1 week ago",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-at-cloudspace-llc-3956178964?position=32&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=B%2FibSW4UAqVPBd%2B%2BfgrTlw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Machine Learning Operations (MLOps) Engineer - AWS (with LLM Focus)",
    "company": "Vakula Technologies Inc",
    "location": "Hollywood, FL",
    "postDate": "6 days ago",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-operations-mlops-engineer-aws-with-llm-focus-at-vakula-technologies-inc-3961585224?position=33&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=03yf0iw2xf8jkODRYtG7BA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "ResponsibilitiesLLM-Optimized MLOps Infrastructure: Design and implement MLOps infrastructure on AWS tailored for LLMs, leveraging services like SageMaker, EC2 (with GPU instances), S3, ECS/EKS, Lambda, and more.LLM Deployment Pipelines: Build and manage CI/CD pipelines specifically for LLM deployment, addressing unique challenges like model size, inference optimization, and versioning.LLMOps Practices: Implement LLMOps best practices for monitoring model performance, drift detection, prompt management, and feedback loops for continuous improvement.RESTful API Development: Design and develop RESTful APIs to expose LLM capabilities to other applications and services, ensuring scalability, security, and optimal performance.Model Optimization: Apply techniques like quantization, distillation, and pruning to optimize LLM models for efficient inference on AWS infrastructure.Monitoring and Observability: Establish comprehensive monitoring and alerting mechanisms to track LLM performance, latency, resource utilization, and potential biases.Prompt Engineering and Management: Develop strategies for prompt engineering and management to enhance LLM outputs and ensure consistency and safety.Collaboration: Work closely with data scientists, researchers, and software engineers to integrate LLM models into production systems effectively.Cost Optimization: Continuously optimize LLMOps processes and infrastructure for cost-efficiency while maintaining high performance and reliability.QualificationsExperience: 3+ years of experience in MLOps or a related field, with hands-on experience in deploying and managing LLMs.AWS Expertise: Strong proficiency in AWS services relevant to MLOps and LLMs, including SageMaker, EC2 (with GPU instances), S3, ECS/EKS, Lambda, and API Gateway.LLM Knowledge: Deep understanding of LLM architectures (e.g., Transformers), training techniques, and inference optimization strategies.Programming Skills: Proficiency in Python and experience with infrastructure-as-code tools (e.g., Terraform, CloudFormation), REST API frameworks (e.g., Flask, FastAPI), and LLM libraries (e.g., Hugging Face Transformers).Monitoring: Familiarity with monitoring and logging tools for LLMs, such as Prometheus, Grafana, and CloudWatch.Containerization: Experience with Docker and container orchestration (e.g., Kubernetes, ECS) for LLM deployment.Problem Solving: Excellent problem-solving and troubleshooting skills in the context of LLMs and MLOps.Communication: Strong communication and collaboration skills to effectively work with cross-functional teams."
  },
  {
    "title": "MLOps Engineer",
    "company": "Eleccion, LLC",
    "location": "Chantilly, VA",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-eleccion-llc-3928904716?position=34&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=csQM%2BXCA1KzfCExLwgCitw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Senior MlOps Engineer",
    "company": "Strativ Group",
    "location": "San Francisco Bay Area",
    "postDate": "4 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/senior-mlops-engineer-at-strativ-group-3943107997?position=35&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=4dLPIuIcbiEXB9jLh605UA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Harnham",
    "location": "New York City Metropolitan Area",
    "postDate": "6 days ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3963040683?position=36&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=C6G0%2Fzs979CFTzCvkHe0ZQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Data Scientist (ML) and (AI)",
    "company": "Extend Information Systems Inc.",
    "location": "New York, NY",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/data-scientist-ml-and-ai-at-extend-information-systems-inc-3908686891?position=37&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=oiSL0K24b810ULRRnb3mrA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Engineering Manager - MLOps",
    "company": "Cognitiv",
    "location": "Bellevue, WA",
    "postDate": "6 days ago",
    "link": "https://www.linkedin.com/jobs/view/engineering-manager-mlops-at-cognitiv-3960263226?position=38&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=z5ON%2B5qp7mSIwP9gqwzRRw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Harnham",
    "location": "United States",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3953805946?position=39&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=SQO6tR4pwWUEUr%2FsZclNVQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "ML Ops Engineer",
    "company": "VIR Consultant LLC",
    "location": "Queens County, NY",
    "postDate": "5 months ago",
    "link": "https://www.linkedin.com/jobs/view/ml-ops-engineer-at-vir-consultant-llc-3808555243?position=40&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=8kMWCV%2BXyHBcp9AL6y6t5g%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOPS Engineer",
    "company": "Accord Technologies Inc",
    "location": "Charlotte, NC",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-accord-technologies-inc-3888465827?position=41&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=Ki7d8LyParfPg10Mnxb7Xw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps & AI Engineer",
    "company": "Net2Source Inc.",
    "location": "United States",
    "postDate": "3 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-ai-engineer-at-net2source-inc-3860312646?position=42&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=vW63R%2BLN%2B05ntn8QIGrOFw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Dematic",
    "location": "Atlanta, GA",
    "postDate": "1 day ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-dematic-3828249118?position=43&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=ygqChKaxluhTpBXcCInR%2Bw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "White Cap",
    "location": "Georgia, United States",
    "postDate": "1 day ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-white-cap-3839578475?position=44&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=AbukqgRJBDCdoI13OmubSA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "A position at White Cap isn’t your ordinary job. You’ll work in an exciting and diverse environment, meet interesting people, and have a variety of career opportunities.The White Cap family is committed to Building Trust on Every Job. We do this by being deeply knowledgeable, fully capable, and always dependable, and our associates are the driving force behind this commitment.Job SummaryResponsible for focusing on the operational aspects of machine learning. Manage, automate, and optimize machine learning (ML) systems that are crucial in enhancing our data-driven initiatives. Ensure the smooth deployment, monitoring, and maintenance of machine learning and advanced analytics models, directly impacting our operational efficiency and decision-making processes.Major Tasks, Responsibilities And Key AccountabilitiesStay updated with the latest in machine learning operations (MLOps) methodologies, tools, and practices, continuously seeking ways to improve existing processes.Work closely with data scientists and other stakeholders to operationalize data products, ensuring smooth transition from development to production.Implement and manage continuous Integration/continuous delivery practices for machine learning systems, ensuring reliable and frequent updates to models.Design and maintain ML system pipelines, focusing on automation, scaling, and efficient model deployment.Monitor ML systems for performance and accuracy, tuning models for optimal operation.Manage cloud-based ML environments, utilizing platforms like Databricks, and Azure DevOps for optimal ML model hosting and execution.Nature and ScopeDemonstrates skill in data analysis techniques by resolving missing/incomplete information and inconsistencies/anomalies in more complex research/data.Nature of work requires increasing independence; receives guidance only on unusual, complex problems or issues. Work review typically involves periodic review of output by a supervisor and/or direct customers of the process.May provide general guidance/direction to or train junior level support or professional personnel.Work EnvironmentLocated in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable.Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.Typically requires overnight travel less than 10% of the time.Education And ExperienceTypically requires BS/BA in a related discipline. Generally 2-5 years of experience in a related field OR MS/MA and generally 2-4 years of experience in a related field. Certification is required in some areas.Preferred QualificationsThis is a remote position.Bachelor’s degree in Computer Science or a related field.Ability to summarize, and communicate technical challenges and solutions effectively.Experience working with and/or building continuous integration and continuous deployment pipelines.Azure Dev Ops or GITLabPython Frameworks: Flask, Django, FastAPIJavascript Frameworks: React, Angular\\\\If you’re looking to play a role in building America, consider one of our open opportunities. We can’t wait to meet you.Functional Area Marketing and CommunicationsRecruiter Haynes, StevenReq ID WCJR-018014White Cap is an Equal Opportunity Minority/Female/Individuals with Disabilities/Protected Veteran and Affirmative Action Employer. White Cap considers for employment and hires qualified candidates without regard to age, race, religion, color, sex, sexual orientation, gender, gender identity, national origin, ancestry, citizenship, protected veteran or disability status or any factor prohibited by law."
  },
  {
    "title": "AI/ML Engineer",
    "company": "Artmac",
    "location": "Dallas, TX",
    "postDate": "5 days ago",
    "link": "https://www.linkedin.com/jobs/view/ai-ml-engineer-at-artmac-3962145658?position=45&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=4x9H1fsyX%2BKxY5a48EJ0Sw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Who We AreArtmac Soft is a technology consulting and service-oriented IT company dedicated to providing innovative technology solutions and services to Customers.Job DescriptionJob Title : AI/ML EngineerJob Type : W2 / C2C / 1099Experience : 8-10 YearsLocation : Dallas, TexasWe are seeking an experienced AI/ML Engineer who will have a strong background in computer science or engineering, with significant experience in AI and machine learning engineering. You will be responsible for developing and deploying large-scale applications in cloud environments, ensuring robust performance monitoring, and collaborating effectively with both technical and non-technical stakeholders.ResponsibilitiesFour or more years of experience in computer software development.At least two years of experience in AI/ML Engineering.Proficiency in programming languages such as Python and Java.Experience in developing large applications in cloud environments (AWS, GCP, on-premise).Hands-on experience with Kubernetes (K8s) for deploying and managing large applications.Strong understanding of real-time system performance monitoring and statistics collection.Basic knowledge of real-time feature engineering practices.Understanding of basic data science concepts and the needs of data scientists.Strong collaboration and communication skills, especially with non-technical business stakeholders.Experience with cloud infrastructures and MLOps practices.Familiarity with CI/CD processes and frameworks such as ArgoCD.Develop, deploy, and maintain large-scale applications in cloud environments including AWS, GCP, and on-premise clusters.Utilize expertise in RTML model serving and large-scale real-time framework development.Implement and manage Kubernetes (K8s) architecture, ensuring proper configuration and troubleshooting.Collect and monitor real-time system performance statistics.Apply basic real-time feature engineering methodologies and practices.Collaborate with data scientists to understand their needs and integrate AI/ML solutions effectively.Engage with business stakeholders to understand requirements and communicate technical solutions clearly.Ensure the adoption of best practices in MLOps and cloud infrastructures.Implement and manage CI/CD processes using frameworks such as ArgoCD.QualificationBachelor's degree or equivalent combination of education and experience"
  },
  {
    "title": "Sr. MLOps Engineer with AZURE and LLM",
    "company": "Warrior Tech Solutions",
    "location": "Dallas, TX",
    "postDate": "3 months ago",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-with-azure-and-llm-at-warrior-tech-solutions-3865770491?position=46&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=iaht4mjJv0mflK2wp83F%2Fg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Job Title: Sr. MLOps Engineer with AZURE and LLM expLocation: Dallas TX (onsite Role)Exp: 10+ yearsVisa: AnyQualification10+ years of experience in implementing MLOps processes and solutions within the Azure ecosystem.Proficiency in Azure cloud services, including AzureML, Azure DevOps, Azure Kubernetes Service (AKS), Azure Databricks, and other relevant Azure services.Strong knowledge of machine learning frameworks and tools compatible with Azure and scikit-learn.Familiarity with Azure Resource Manager templates and Infrastructure as Code (IaC).Experience with version control systems, particularly Git, and CI/CD pipelines using Azure DevOps.Should have implemented test automation scripts to validate the deployment process. Scripting and coding skills, with proficiency in languages such as Python, PySpark, PowerShell, or Azure CLI.Understanding of security and compliance standards within the Azure ecosystem.Should have executed atleast 2 Azure MLOps projectShould have worked atleast 2 projects using Agile/SAFe methodologyProblem-solving and troubleshooting abilities.Should have cross global location experience and been part of a team with atleast 15+ members in a global delivery modelAzure-specific certifications can be a plus, such as Microsoft Certified: Azure AI Engineer Associate or Microsoft Certified: Azure DevOps Engineer Expert.ResponsibilitiesCollaborate with data scientists and engineers to design, build, and maintain Azure-based MLOps pipelines for automating machine learning model deployment, monitoring, and maintenance.Configure and manage Azure cloud resources to support machine learning workloads efficiently.Collaborate with Azure administrators to ensure scalable and reliable infrastructure for MLOps.Implement Azure-based deployment pipelines for deploying machine learning models into production environments.Implement test automation script to monitor & validate the deployment process.Work alongside data engineers to develop and maintain data pipelines on Azure, ensuring proper data governance and integration with MLOps pipelines.Implement data versioning, data lineage tracking, and other data management best practices.Implement test automation script to monitor & validate the deployment process.Ensure that MLOps processes on Azure adhere to security and regulatory standards.Monitor and troubleshoot application and infrastructure issues and implement solutions in a timely mannerCollaborate with development and BI teams to ensure code quality and application performanceStay updated on the latest Azure MLOps tools and services and integrate improvements into existing processes"
  },
  {
    "title": "MLOps Engineer",
    "company": "Zencon Group",
    "location": "United States",
    "postDate": "5 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-zencon-group-3797047264?position=47&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=iJZRMvTTIhmvBN8pRNxWZw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Stanford Health Care",
    "location": "Sacramento, CA",
    "postDate": "8 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-stanford-health-care-3727279439?position=48&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=x%2FG%2FHRJ18zX6%2FVUtIctjyA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "AWS/ML Ops Specialist",
    "company": "Steneral Consulting",
    "location": "Falls Church, VA",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/aws-ml-ops-specialist-at-steneral-consulting-3918875212?position=49&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=jzFyFU02JwBKkpYPxKKpgg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "1 day onsite/week, must be local and under 60 minsNeed valid LinkedInNeed 2 references with official contact detailsRequirements 5+ years of hands-on technical experience within AWS analytics utilizing SageMaker for Machine LearningIncluding experience with AWS SageMaker Studio to build, train, and deploy ML models into production Extensive data science and machine learning engineering experience including establishing model governance frameworks Hands-on experience programming in Python or R Healthcare industry specific experience in a consultant type role – exposure to multiple projects and clients B.S. Degree Excellent communication skills with ability to be both solution oriented (customer facing, gathering requirements) as well as hands-on with tech/development team Preferred SkillsGovernment/Federal agency experience AWS Big Data Certifications ResponsibilitiesBuild and configure end-to-end MLOps pipeline on AWS cloud for model management, model deployment & service and model governance using AWS SageMaker. Use Amazon SageMaker Studio for development and tracking.Implement CI/CD pipelines using GITLAB to automate model deployment and updates, enabling rapid iterations and reducing time-to-market.Create Framework for deploying Client models to production environments using SageMaker endpoints and set up monitoring to track model performance and drift over time.Set up and run SageMaker Clarify bias analysis through Amazon Sagemaker Experiments to check the model for potential biases.Setup SageMaker Model Monitor to allow clients to select data from a menu of options such as prediction output, and capture metadata such as timestamp, model name, and end point so that clients can analyze model predictions based on the metadata.Maintain logs for reproducibility, validation, conformity, and auditability.Add Cohort model explainability used in the deployment phase, specifically in the model validation step before deployment.Implement static deployment strategies (using traffic routing patterns) to deploy Client model(s) - Blue/Green, A/B"
  },
  {
    "title": "Senior ML Operations Engineer (MLOps)",
    "company": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/senior-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897983124?position=50&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=mksDKIgvXAINqqDhRQ6ekA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company Overview: Welcome to the forefront of machine learning operations (MLOps)! Our company is dedicated to harnessing the power of machine learning to drive innovation and transform industries. We're committed to developing cutting-edge ML solutions that deliver real-world impact and value to our customers. Join us and be part of a dynamic team shaping the future of MLOps.Position Overview: As a Senior ML Operations Engineer, you'll play a critical role in building and maintaining the infrastructure and processes that enable the deployment, monitoring, and management of machine learning models at scale. You'll work closely with data scientists, software engineers, and DevOps teams to streamline the machine learning lifecycle and ensure reliable and efficient model operations. If you're a seasoned engineer with a passion for machine learning and a track record of designing and implementing MLOps solutions, we want you on our team.RequirementsKey Responsibilities: Infrastructure Design: Design and implement scalable and reliable infrastructure for deploying and serving machine learning models, leveraging cloud platforms and containerization technologies Model Deployment: Develop automated pipelines for deploying machine learning models into production environments, ensuring consistency, reliability, and reproducibility Monitoring and Alerting: Implement monitoring and alerting systems to track model performance, data drift, and other metrics, enabling proactive detection and mitigation of issues Model Versioning and Management: Establish version control and management processes for machine learning models, enabling easy tracking, rollback, and experimentation Continuous Integration/Continuous Deployment (CI/CD): Implement CI/CD pipelines for automating model training, testing, and deployment, reducing time to market and improving agility Scalability and Efficiency: Optimize the performance and scalability of machine learning infrastructure, leveraging techniques such as distributed computing, parallelization, and resource management Security and Compliance: Ensure machine learning systems comply with security and privacy standards, implementing access controls, encryption, and other security measures as needed Documentation and Best Practices: Document MLOps processes, best practices, and standards, providing guidance and training to data scientists and engineers Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and DevOps teams, to streamline the machine learning lifecycle and drive continuous improvement Research and Innovation: Stay informed about the latest advancements in MLOps tools and technologies, exploring innovative approaches and techniques to enhance machine learning operationsQualifications:Bachelor's degree or higher in Computer Science, Engineering, Mathematics, or related field5+ years of experience in software engineering, DevOps, or related roles, with a focus on building and maintaining infrastructure for machine learning operationsStrong understanding of machine learning concepts and techniques, with experience working with data science teams and machine learning modelsProficiency in programming languages such as Python, Java, or Scala, and experience with cloud platforms such as AWS, Azure, or Google Cloud PlatformExperience with containerization technologies such as Docker and orchestration tools such as KubernetesFamiliarity with machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, or MLflowExperience with CI/CD pipelines, version control systems, and automation tools such as Jenkins, GitLab, or CircleCIStrong problem-solving skills and analytical thinking, with the ability to troubleshoot complex issues and optimize system performanceExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for Senior ML Operations Engineers typically ranges from $170,000 to $250,000 per year, depending on experience and qualificationsComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge tools and resourcesVibrant and inclusive company culture with opportunities for growth and advancementExciting projects with real-world impact at the forefront of MLOps innovationJoin Us: Ready to shape the future of machine learning operations? Apply now to join our team and drive innovation in MLOps!"
  },
  {
    "title": "Senior ML Operations Engineer (MLOps)",
    "company": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/senior-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897981425?position=51&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=eJLt%2BYYbKCYhk9VbybAtug%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MLOps Engineer",
    "company": "Harnham",
    "location": "United States",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3950533675?position=52&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=xxga1lFwlR9ntYavcPynBw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "AWS/ML Ops Specialist",
    "company": "Steneral Consulting",
    "location": "Falls Church, VA",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/aws-ml-ops-specialist-at-steneral-consulting-3919672343?position=53&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=eBHUCCaByytRW%2Fy2xqpacA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Senior MLOps Engineer",
    "company": "DeepRec.ai",
    "location": "San Francisco, CA",
    "postDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/senior-mlops-engineer-at-deeprec-ai-3911883376?position=54&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=X1mP4jRfhyAqASvEvcu4DA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "Lead ML Operations Engineer (MLOps)",
    "company": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/lead-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897983139?position=55&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=3ua2xwoER8EOOHeGoiKxYQ%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company Overview: Welcome to the forefront of machine learning operations (MLOps)! Our company is dedicated to leveraging the power of machine learning to drive innovation and transform industries. We're committed to developing cutting-edge ML solutions that deliver real-world impact and value to our customers. Join us and lead our team in shaping the future of MLOps.Position Overview: As the Lead ML Operations Engineer, you'll be responsible for leading our MLOps efforts and driving the design, implementation, and optimization of infrastructure and processes for deploying, monitoring, and managing machine learning models at scale. You'll lead a team of talented engineers and collaborate closely with data scientists, software engineers, and DevOps teams to streamline the machine learning lifecycle and ensure reliable and efficient model operations. If you're a seasoned engineer with a passion for machine learning and a track record of designing and implementing MLOps solutions, we want you on our team.RequirementsKey Responsibilities: Technical Leadership: Lead and mentor a team of ML Operations Engineers, providing guidance, direction, and support in driving MLOps innovation and execution Infrastructure Design: Design and implement scalable and reliable infrastructure for deploying and serving machine learning models, leveraging cloud platforms and containerization technologies Model Deployment: Develop automated pipelines for deploying machine learning models into production environments, ensuring consistency, reliability, and reproducibility Monitoring and Alerting: Implement monitoring and alerting systems to track model performance, data drift, and other metrics, enabling proactive detection and mitigation of issues Model Versioning and Management: Establish version control and management processes for machine learning models, enabling easy tracking, rollback, and experimentation Continuous Integration/Continuous Deployment (CI/CD): Implement CI/CD pipelines for automating model training, testing, and deployment, reducing time to market and improving agility Scalability and Efficiency: Optimize the performance and scalability of machine learning infrastructure, leveraging techniques such as distributed computing, parallelization, and resource management Security and Compliance: Ensure machine learning systems comply with security and privacy standards, implementing access controls, encryption, and other security measures as needed Documentation and Best Practices: Document MLOps processes, best practices, and standards, providing guidance and training to data scientists and engineers Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and DevOps teams, to streamline the machine learning lifecycle and drive continuous improvement Research and Innovation: Stay informed about the latest advancements in MLOps tools and technologies, exploring innovative approaches and techniques to enhance machine learning operationsQualifications:Bachelor's degree or higher in Computer Science, Engineering, Mathematics, or related field7+ years of experience in software engineering, DevOps, or related roles, with a focus on building and maintaining infrastructure for machine learning operationsLeadership experience, with a demonstrated ability to lead and mentor a team of engineersStrong understanding of machine learning concepts and techniques, with experience working with data science teams and machine learning modelsProficiency in programming languages such as Python, Java, or Scala, and experience with cloud platforms such as AWS, Azure, or Google Cloud PlatformExperience with containerization technologies such as Docker and orchestration tools such as KubernetesFamiliarity with machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, or MLflowExperience with CI/CD pipelines, version control systems, and automation tools such as Jenkins, GitLab, or CircleCIStrong problem-solving skills and analytical thinking, with the ability to troubleshoot complex issues and optimize system performanceExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for Lead ML Operations Engineers typically ranges from $150,000 to $250,000 per year, depending on experience and qualificationsComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge tools and resourcesVibrant and inclusive company culture with opportunities for growth and advancementExciting projects with real-world impact at the forefront of MLOps innovationJoin Us: Ready to lead the charge in MLOps innovation? Apply now to join our team and shape the future of machine learning operations!"
  },
  {
    "title": "Staff MLOps Engineer",
    "company": "Storm3",
    "location": "United States",
    "postDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/staff-mlops-engineer-at-storm3-3955571679?position=56&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=EzPaL5t8k9PuJJXiZxHPig%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "MlOPS Engineer with google vertiex AI",
    "company": "HCL Global Systems Inc",
    "location": "Farmington Hills, MI",
    "postDate": "3 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-with-google-vertiex-ai-at-hcl-global-systems-inc-3862182428?position=57&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=6JO6lObWfkHBP%2BJ9XjY5Jw%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  },
  {
    "title": "GCP ML AI Engineer [Hybrid]- w2 only",
    "company": "SmartIPlace",
    "location": "Dearborn, MI",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/gcp-ml-ai-engineer-hybrid-w2-only-at-smartiplace-3901504080?position=58&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=TKr%2B6qF5xzb6DDR6ZAUHVg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Title- GCP ML AI Engineer [w2 ]Location- Hybrid 2-3 days onsite Dearborn, MI (Local is great but will also accept from from EST/CST only)Visa- USC/GCJob Description GDI&A is looking for a Software Engineer focused on building and driving the strategy forward for our internal AI/ML platform. This role will work in a small, cross-functional teams. The position will collaborate directly and continuously with business partners, product managers and designers, and will release early and often. The team you will be working on supports ML Practitioners and Data Scientists in their Mach1ML (Company’s AI/ML platform similar to Uber’s Michelangelo, Facebook’s FBLearner, etc) on GCP journey or other ML Engineering / MLOps tasks, focusing on Mach1ML adoption and AI/ML democratization.Skills Required Work closely with Tech Anchor, Product Manager and Product Owner to deliver machine learning use cases using Agile Methodology. Work with other Software and ML Engineers to tackle challenging AI problems. Participate in Pair Programming for cross training/upskilling, problem solving, and speed to delivery. Leverage latest ML and GCP technologies. Work with Architects to make technical decision on tools, integration, and other issues. Drive PoCs/Discoveries of new tools and technologies to support robust ML Platform Collaborate with other software engineers to understand platform vision, break out tasks and help them solve complex issues. Grow technical capabilities / expertise and provide guidance to other software engineers on the team.Skills Preferred Experience working with Google Cloud platform. Experience with Python and has used Machine Learning tools (pytorch, tensorflow, xgboost etc). Experience using orchestration tools like Airflow. Good to have experience or knowledge of Deep Learning, LLM. Basic knowledge on React / Angular. Experience in supporting continuous improvement by investigating development alternatives. Experience in Software Craftsmanship such as Paired Programming, Test Driven Development, DevOps etc. Experience working with container technology, docker files, docker images, GitHub, CI/CD concepts. Experience applying Agile practices to solution delivery. Must be a self-starter to understand existing bottlenecks and come up with innovative solutions. Open to learning new technology. Strong communication and presentation skills, ability to share/teach others, work collaboratively with others. Good understanding of cloud design considerations and limitations and impact of pricing.Experience Required Bachelor’s degree in Computer Science or a related field of study 2+ years of experience in Python, Machine Learning Technologies or Deep Learning. 3+ years of work experience as a software engineer with exceptional software engineering knowledge. Experience working with Google Cloud Platform or other cloud experience.Education Required Bachelor’s degree in Computer Science or a related field of study"
  },
  {
    "title": "Senior ML Operations Engineer (MLOps)",
    "company": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/senior-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897978554?position=59&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=39am6RuKNbzBmEwWY1xJHg%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": "Company Overview: Welcome to the forefront of machine learning operations (MLOps)! Our company is dedicated to leveraging the power of machine learning to drive innovation and transform industries. We're committed to developing cutting-edge ML solutions that deliver real-world impact and value to our customers. Join us and lead our team in shaping the future of MLOps.Position Overview: As the Lead ML Operations Engineer, you'll be responsible for leading our MLOps efforts and driving the design, implementation, and optimization of infrastructure and processes for deploying, monitoring, and managing machine learning models at scale. You'll lead a team of talented engineers and collaborate closely with data scientists, software engineers, and DevOps teams to streamline the machine learning lifecycle and ensure reliable and efficient model operations. If you're a seasoned engineer with a passion for machine learning and a track record of designing and implementing MLOps solutions, we want you on our team.RequirementsKey Responsibilities: Technical Leadership: Lead and mentor a team of ML Operations Engineers, providing guidance, direction, and support in driving MLOps innovation and execution Infrastructure Design: Design and implement scalable and reliable infrastructure for deploying and serving machine learning models, leveraging cloud platforms and containerization technologies Model Deployment: Develop automated pipelines for deploying machine learning models into production environments, ensuring consistency, reliability, and reproducibility Monitoring and Alerting: Implement monitoring and alerting systems to track model performance, data drift, and other metrics, enabling proactive detection and mitigation of issues Model Versioning and Management: Establish version control and management processes for machine learning models, enabling easy tracking, rollback, and experimentation Continuous Integration/Continuous Deployment (CI/CD): Implement CI/CD pipelines for automating model training, testing, and deployment, reducing time to market and improving agility Scalability and Efficiency: Optimize the performance and scalability of machine learning infrastructure, leveraging techniques such as distributed computing, parallelization, and resource management Security and Compliance: Ensure machine learning systems comply with security and privacy standards, implementing access controls, encryption, and other security measures as needed Documentation and Best Practices: Document MLOps processes, best practices, and standards, providing guidance and training to data scientists and engineers Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and DevOps teams, to streamline the machine learning lifecycle and drive continuous improvement Research and Innovation: Stay informed about the latest advancements in MLOps tools and technologies, exploring innovative approaches and techniques to enhance machine learning operationsQualifications:Bachelor's degree or higher in Computer Science, Engineering, Mathematics, or related field7+ years of experience in software engineering, DevOps, or related roles, with a focus on building and maintaining infrastructure for machine learning operationsLeadership experience, with a demonstrated ability to lead and mentor a team of engineersStrong understanding of machine learning concepts and techniques, with experience working with data science teams and machine learning modelsProficiency in programming languages such as Python, Java, or Scala, and experience with cloud platforms such as AWS, Azure, or Google Cloud PlatformExperience with containerization technologies such as Docker and orchestration tools such as KubernetesFamiliarity with machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, or MLflowExperience with CI/CD pipelines, version control systems, and automation tools such as Jenkins, GitLab, or CircleCIStrong problem-solving skills and analytical thinking, with the ability to troubleshoot complex issues and optimize system performanceExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for Lead ML Operations Engineers typically ranges from $150,000 to $250,000 per year, depending on experience and qualificationsComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge tools and resourcesVibrant and inclusive company culture with opportunities for growth and advancementExciting projects with real-world impact at the forefront of MLOps innovationJoin Us: Ready to lead the charge in MLOps innovation? Apply now to join our team and shape the future of machine learning operations!"
  },
  {
    "title": "Azure DevOps/MLOps Engineer",
    "company": "Donato Technologies, Inc.",
    "location": "San Antonio, TX",
    "postDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/azure-devops-mlops-engineer-at-donato-technologies-inc-3888437647?position=60&pageNum=0&refId=Jfdwc1LhRyh%2BwZJZxMnGNw%3D%3D&trackingId=d2C01t3GDq7cl00bOxaIIA%3D%3D&trk=public_jobs_jserp-result_search-card",
    "description": ""
  }
]